const texts = {
  seo: {
    // حط هنااسم ووصف للموقع لتحسين نتائج محركات البحث
    title: "Naxab - نكسب",
    website_url: "naxab.net",
    website_image: "../assets/imgs/site_img.jpg",
    keywords: "اكسب مكافئات، جمع نقاط، اكسب عملاء جدد، تطبيق نكسب، نقاط الولاء، نقاط الكاش باك"
  },
  tabs_names: {
    //  اسماء التابات
    first_tab: "نكسب للعملاء",
    second_tab: "نكسب للمتاجر"
  },
  sellers: {
    // الجزء الخاص بالمتاجر
    // navbar menuهنا حط اسماء وروابط اللينكات اللي بتظهر فوق في ال 
    navLinks: {
      link1: {
        sectionHash: "index",
        path: "/",
        title: "الرئيسية"
      },
      link2: {
        sectionHash: "about_naxab",
        path: "/",
        title: "تعرف علي نكسب"
      },
      link3: {
        sectionHash: "get_points",
        path: "/",
        title: "امنح عملائك نقاط نكسب"
      },
      link4: {
        sectionHash: "stats",
        path: "/",
        title: "نسب وإحصائيات"
      },
      link5: {
        sectionHash: "features",
        path: "/",
        title: "أهم المزايا"
      },
      link6: {
        sectionHash: "contact_us",
        path: "/",
        title: "تواصل معنا"
      }
    },
    head_titles: {
      // عدل هنا عناوين اقسام تابة المتاجر
      first: {
        text: "تعرف على",
        highlight: "نكسب"
      },
      second: {
        text: "امنح عملائك",
        highlight: "النقاط"
      },
      third: {
        text: "نسب",
        highlight: "وإحصائيات"
      },
      fourth: {
        text: "اهم",
        highlight: "المزايا"
      },
      fifth: {
        text: "تواصل",
        highlight: "معنا"
      },
      sixth: {
        text: "تابعنا",
        highlight: "على"
      }
    },
    about: {
      // حط هنا لينك الفيديو في قسم تعرف علي نكسب والصورة هتتبدل بالفيديو لوحدها
      video_url: "",
      description: `لديك عملاء بالفعل يترددون على متجرك باستمرار ويفضلون شراء بضاعتك ومنتجاتك ، فلم لا تكافئهم على تكرار عمليات الشراء هذه وتحفزهم وتشجعهم على ذلك أكثر فأكثر من خلال منحهم نقاط نكسب ، إما نقاط ( كاش باك ) ، أو نقاط ( الولاء ) ليزداد ولائهم لمتجرك وارتباطهم به .
      عزز ولاء عملائك الحاليين وقوي علاقتهم بعلامتك التجارية .
      وكذلك قم بجذب عملاء جدد من خلال العروض والخصومات التي تقدمها داخل التطبيق وتحويلها إلى نقاط ومكافئات عينية يمكن لعملائك وزبائنك صرفها والاستفادة منها بعد ذلك .
      تطبيق نكسب المعنى الحقيقي لتطوير برامج الولاء 
                                    تطبيق نكسب .... كله مكسب 
                                تطبيق نكسب .... هو مكسب حقيقي 
                                          للعميل ، وللتاجر`
    },
    // نصوص الوصف لتابة المتاجر
    intro_section: {
      text1: `الذي يمكن عـــــمــــلائـــــك من الاسـتـفــــادة من العروض
       والـخــصــــومـــات التي تقدمها لهم وتحويلها إلى نـقـــــاط ومكافئات تمنحها لهم لتعزيز ولائهم لعلامتك التجارية`,
      text2: "نكسب .. حافظ على عملائك الحاليين",
      text3: "واكسب عملاء جدد"
    },
    // غير هنا الصورة والوصف و العنوان لكل عنصر في قسم رحلتك مع النقاط. ممكن تضيف او تمسح عناصر لو عايز
    points_illustrations: [
      {
        image: "../assets/imgs/Wallet-rafiki.svg",
        description: " <br/> نقاط الكاش باك هي الـنــقـــــــــاط التي ســـوف تمنحها للعميل ويكتسبها في محفظته من خلال نسبة الخصم المحددة على الفاتورة ، وتحتسب هذه النسبة من إجمالي قيمة فاتورة مشترياته ويمكن للعميل صرف هذه النقاط بعد ذلك من المتجر الذي منحه النقاط من خلال عمليات الشراء",
        title: "نقاط (كاش باك)"
      },
      {
        image: "../assets/imgs/Appreciation-rafiki.svg",
        description: "هي النقاط التي سوف يجمعها العميل من كل مرة عملية شــــــراء يجـريـهـــــا من خـلال فـــاتـــــــــورة مشترياته ، وهذه النقاط تكون مـســــاويـــــة لإجمالي قيمة الـفــاتــورة ، ويتم تجميعها حتى يصل العميل إلى حد الـــولاء المطلوب منه ويحصل على مـكـافـئـــة الولاء بعد ذلك",
        title: "نقاط (الولاء)"
      }
    ],
    // نصوص عناصر النسب واحصاءات
    facts_list: [
      "هل تعلم أن عملائك الحاليين ينفقون من خلال مشترياتهم بمعدل أكثر من ٦٠ ٪ من العملاء الجدد",
      "هل تعلم أن أكثر من ٨٠ ٪ يؤكدون أن برامج الولاء تجعلهم أكثر رغبة وقابلية لإعادة التعامل وتكراره مع نفس العلامة التجارية ذاتها",
      "هل تعلم أن تكلفة جذب عميل للمرة الأولى تكلفك من ٥ إلى ٢٠ ضعف ما تنفقه على الحفاظ على العملاء الحاليين",
      "هل تعلم أن نسبة اقتناع عملائك الحاليين بتجربة منتج جديد من منتجاتك تفوق ال ٥٠ ٪ وهم على استعداد تام للشراء والإنفاق بشكل أكبر بكثير من العملاء الجدد",
      "هل تعلم أن العروض والخصومات تجذب أكثر من ٧٥ ٪ من المستهلكين عند اختيارهم للعلامة التجارية وعزمهم علي الشراء"
    ],
    // نصوص الجزء الاسفل لقسم النسب و الاحصاءات
    joining_invetation: {
      text1: "لك اغتنم تلك الفرصة ",
      text2: "وبادر بالانضمام إلى العلامات التجارية وانضم للتطبيق وقم <br/> بتجربة مختلفة وفريدة من نوعها في عالم نقاط وبرامج الولاء",
      button_text: "انضم الآن وابدأ التجربة"
    },
    // اهم المزايا - المتاجر
    features: [
      "واجهة سهلة وجذابة للعميل وللمتجر",
      "إدراج بيانات متجرك ووسائل التواصل وصور لكل قسم من منتجاتك",
      "لوحة بيانات وتحليل سلوك العملاء",
      "إمكانية إضافة أكثر من فرع وتحديد موقعه على الخريطة GPS",
      "لا يستلزم الربط مع أي نظام آخر",
      "منح وإضافة النقاط من خلال فاتورة المشتريات",
      "إمكانية إضافة حسابات موظفين ( مدراء ، كاشير )",
      "تحكم في نسبة الخصم المناسبة التي تقدمها لعملائك وتغييرها في أي وقت",
      "تمكين العميل من متابعة نقاط محفظته وكذلك معدل حد الولاء",
      "اختر مبلغ حد الولاء المطلوب الوصول إليه من تكرار مشتريات عملائك",
      "سهولة آلية صرف النقاط والمكافئات للعميل"
    ]
  },
  customers: {
    // الجزء الخاص بالعملاء
    // navbar menuهنا حط اسماء وروابط اللينكات اللي بتظهر فوق في ال
    navLinks: {
      link1: {
        sectionHash: "index",
        path: "/",
        title: "الرئيسية"
      },
      link2: {
        sectionHash: "about_naxab",
        path: "/",
        title: "تعرف علي نكسب"
      },
      link3: {
        sectionHash: "get_points",
        path: "/",
        title: "رحلات مع النقاط"
      },
      link4: {
        sectionHash: "features",
        path: "/",
        title: "أهم المزايا"
      },
      link5: {
        sectionHash: "trade_marks",
        path: "/",
        title: "العلامات التجارية"
      },
      link6: {
        sectionHash: "contact_us",
        path: "/",
        title: "تواصل معنا"
      }
    },
    // نصوص الوصف لتابة العملاء
    intro_section: {
      text1: "الذي يمكنك من الاستفادة من العروض والخصومات المقدمة من المتاجر والعلامات التجارية",
      text2: "وتجميع النقاط .. وكسب المكافئات",
      text3: ""
    },
    // اسماء العناوين
    head_titles: {
      _comment: "عدل هنا عناوين اقسام تابة العملاء",
      first: {
        text: "تعرف على",
        highlight: "نكسب"
      },
      second: {
        text: "رحلتك مع",
        highlight: "النقاط"
      },
      third: {
        text: "أهم",
        highlight: "المزايا"
      },
      fourth: {
        text: "العلامات",
        highlight: "التجارية"
      },
      fifth: {
        text: "تواصل",
        highlight: "معنا"
      },
      sixth: {
        text: "تابعنا",
        highlight: "على"
      }
    },
    about: {
      // حط هنا لينك الفيديو في قسم تعرف علي نكسب والصورة هتتبدل بالفيديو لوحدها
      video_url: "",
      description: `كل واحد منا لا يمكنه الاستغناء عن التسوق وشراء أغراضه ومتطلباته التي يحتاج إليها  من أطعمة ومشروبات وملابس وإكسسوارات وهدايا ومقتنيات .....
      وطالما تتسوق باستمرار فلم لا تستفيد من عمليات الشراء العديدة والمتكررة التي تجريها ، بل ويمكنك تحويلها إلى استثمار رابح  وادخار نافع ، يعود عليك بالنفع والكسب بعد ذلك .
      أصبحت الآن تستطيع مع تطبيق نكسب تحقيق ذلك الاستثمار الرابح ، والحصول عليه .
      فتطبيق نكسب هو التطبيق الأول الذي يمكنك من الاستفادة من العروض والخصومات التي تقدمها المتاجر والعلامات التجارية لعملائها .
       بحيث يجمع ما بين المتاجر من جهة ، وبين العملاء والزبائن من جهة أخرى ،  وينسق آلية طرح الخصومات والعروض المقدمة من تلك المتاجر بطريقة حديثة ومبتكرة ليحولها إلى نقاط ( كاش باك ) تعود على العميل ويتم الاحتفاظ بها في محفظته داخل التطبيق ،  ليتمكن من صرف هذه النقاط بعد ذلك في عمليات الشراء من تلك المتاجر التي منحته النقاط .
       أو ( نقاط ولاء ) والتي تضاف لزيادة معدل الولاء ، ويزيد هذا المعدل كلما زادت عمليات شرائك حتى تصل إلى حد الولاء المطلوب ، وهو القدر الذي حدده المتجر للوصول إليه كي تحصل على مكافأة الولاء المخصصة لذلك .
       ويمكنك إضافة النقاط بنفسك من خلال فاتورة مشترياتك ، بطريقة سهلة وبسيطة وميسرة بدون تدخل البائع أو مراجعة الكاشير .
      وذلك يكون بالضغط على زر ( إضافة النقاط ) الموجود في أعلى الصفحة الرئيسية للتطبيق ، وتوجيه كاميرا الجوال على رمز الكيو أر كود أو الباركود الموجود على فاتورة المشتريات ، فتتم عملية إضافة النقاط تلقائيا وفي الحال . 
      كما تستطيع أن تتابع نقاط محفظتك ومعدل ولائاتك من داخل التطبيق وتطلع عليها وقت ما تشاء بكل سهولة ويسر .
      قبل تطبيق نكسب كنت تتسوق من المتاجر وتنفق أموالك بدون استفادة أو عائد يعود عليك وينفعك .
      ولكن الآن مع تطبيق نكسب تستطيع أن تحول كل عمليات شرائك إلى استثمار حقيقي وإدخار يعود عليك بالكسب والنفع .
      وكلما زادت مشترياتك ، كلما زادت نقاطك ومكافئاتك .
                                 تطبيق نكسب .... كله مكسب 
                            تطبيق نكسب .... هو مكسب حقيقي 
                                      للعميل ، والتاجر 
      سارع في تحميل التطبيق وكن من مستخدميه لتستفيد من أقوى الخصومات والعروض الحصرية المقدمة  من المتاجر والعلامات التجارية ، وقم بجمع النقاط واحصل على المكافآت .`
    },
    // غير هنا الصورة والوصف لكل عنصر في قسم رحلتك مع النقاط. ممكن تضيف او تمسح عناصر لو عايز
    points_illustrations: [
      {
        image: "../assets/imgs/Online Groceries-cuate.svg",
        description: "تصفح أفضل المتاجر والعلامات التجارية داخل تطبيق نكسب",
        title: ""
      },
      {
        image: "../assets/imgs/Thrift shop-rafiki.svg",
        description: "اذهب للشراء من إحدى هذه المتاجر واحتفظ بفاتورة المشتريات",
        title: ""
      },
      {
        image: "../assets/imgs/QR Code-rafiki_1.svg",
        description: "افتح تطبيق نكسب وامسح الرمز الموجود على الفاتورة لإضافة النقاط",
        title: ""
      },
      {
        image: "../assets/imgs/QR Code-rafiki_2.svg",
        description: "تمت إضافة النقاط بنجاح (نقاط كاش باك أو نقاط ولاء)",
        title: ""
      },
      {
        image: "../assets/imgs/Shop giveaway-bro.svg",
        description: "استبدل نقاط محفظتك أو احصل على مكافئك من المتجر الذى منحك إياها",
        title: ""
      }
    ],
    // عناصر قسم اهم المزايا sliders
    features_slides: [
      {
        image: "../assets/imgs/mobile-1.png",
        description: "تابع نقاط محفظتك أولا بأول من داخل التطبيق"
      },
      {
        image: "../assets/imgs/mobile-1.png",
        description: "تابع نقاط محفظتك أولا بأول من داخل التطبيق"
      },
      {
        image: "../assets/imgs/mobile-1.png",
        description: "تابع نقاط محفظتك أولا بأول من داخل التطبيق"
      },
      {
        image: "../assets/imgs/mobile-1.png",
        description: "تابع نقاط محفظتك أولا بأول من داخل التطبيق"
      },
      {
        image: "../assets/imgs/mobile-1.png",
        description: "تابع نقاط محفظتك أولا بأول من داخل التطبيق"
      }
    ],
    // حط هنا لينكات وايقونات العلامات التجارية. باردو ممكن تضيف او تمسح عناصر
    trade_marks: [
      {
        label_Icon: "",
        link: ""
      },
      {
        label_Icon: "",
        link: ""
      },
      {
        label_Icon: "",
        link: ""
      },
      {
        label_Icon: "",
        link: ""
      }
    ]
  },
  call_to_action: {
    // دا نص قسم الجزء الاصفر
    text: "استمتع بتجربة فريدة وممتعة في عالم الخصومات والنقاط والمكافئات",
    highlight: "وقم بتحميل التطبيق"
  },
  links: {
    // حط لينكات السوشيال ميديا تحت
    socials: {
      instagram: "#",
      facebook: "#",
      twitter: "#",
      snapchat: "#"
    },
    // لينكات البرنامج علي جوجل ستور وابل ستور
    app_links: {
      google_store: "#",
      apple_store: "#"
    }
  },
  footer_copyright: {
    // نص الحقوق المحفوظة في زيل الصفحة
    text: "جميع الحقوق محفوظة"
  },
  // ضيف لينك لزرار انضم الآن وابدأ التجربة
  join_us_button_link: "#",
  // الخاص بتواصل معانا تحت URL requestحط لينك ال
  contact_us_request_url: ""
}

export default texts;